# GetName Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TransactionGroup..::..GetName Method
TransactionGroup Class See Also
---
Returns the transaction group's name. It could be an empty string.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public string GetName()
```

Visual Basic
---
```text
Public Function GetName As String
```

Visual C++
---
```text
public:
String^ GetName()
```

# ### Return Value
The transaction group's current name.
# See Also
TransactionGroup Class
Autodesk.Revit.DB Namespace